## `terraform/keeping`
#### Terraform Format and Style 🖌`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.custom_iam_role_for_github.data.http.github_actions_openid_configuration: Reading...
module.custom_chatbot.module.chatbot_slack_configuration.data.local_file.cloudformation_template: Reading...
module.custom_chatbot.module.chatbot_slack_configuration.data.local_file.cloudformation_template: Read complete after 0s [id=34d55e91682b29a9c65529178b71ea86f6a6a99b]
module.custom_iam_role_for_github.data.http.github_actions_openid_configuration: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]
module.custom_iam_role_for_github.data.tls_certificate.github_actions: Reading...
module.custom_iam_role_for_github.data.tls_certificate.github_actions: Read complete after 0s [id=42213ff4be793356631c8e7788749fa7d39a9d85]
module.custom_sns.data.aws_iam_policy_document.policy_for_encrypt_sns_topic: Reading...
module.custom_sns.data.aws_iam_policy_document.policy_for_encrypt_sns_topic: Read complete after 0s [id=3154560550]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # null_resource.name will be created
  + resource "null_resource" "name" {
      + id = (known after apply)
    }

  # module.custom_iam.aws_iam_policy.chatbot-notification-only will be created
  + resource "aws_iam_policy" "chatbot-notification-only" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "chatbot-notification-only"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:DescribeQueryDefinitions",
                          + "logs:DescribeLogGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.custom_iam.aws_iam_role.chatbot-notification-only will be created
  + resource "aws_iam_role" "chatbot-notification-only" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "chatbot.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "AWS Chatbot Execution Role for Only Notification"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "chatbot-notification-only"
      + name_prefix           = (known after apply)
      + path                  = "/service-role/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.custom_iam.aws_iam_role.main_ecs_tasks will be created
  + resource "aws_iam_role" "main_ecs_tasks" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs_tasks-minecraft-test-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.custom_iam.aws_iam_role.task_execution_role will be created
  + resource "aws_iam_role" "task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "minecraft-test-ecs_tasks_execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.custom_iam.aws_iam_role_policy.ExecuteCommand will be created
  + resource "aws_iam_role_policy" "ExecuteCommand" {
      + id     = (known after apply)
      + name   = "minecraft-test-ExecuteCommand"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssmmessages:CreateControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:OpenDataChannel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.custom_iam.aws_iam_role_policy.execution_policy will be created
  + resource "aws_iam_role_policy" "execution_policy" {
      + id     = (known after apply)
      + name   = "minecraft-test-task-execution-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:Get*",
                          + "s3:List*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogGroup",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ssm:Getparameters",
                          + "secretsmanager:GetSecretValue",
                          + "kms:Descypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.custom_iam.aws_iam_role_policy.firelensPolicy will be created
  + resource "aws_iam_role_policy" "firelensPolicy" {
      + id     = (known after apply)
      + name   = "minecraft-test-firelensPolicy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucketMultipartUploads",
                          + "kms:Decrypt",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                          + "s3:ListBucket",
                          + "logs:CreateLogGroup",
                          + "logs:PutLogEvents",
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "logs:CreateLogStream",
                          + "s3:AbortMultipartUpload",
                          + "kms:GenerateDataKey",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "VisualEditor0"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.custom_iam.aws_iam_role_policy_attachment.chatbot-notification-only-attach will be created
  + resource "aws_iam_role_policy_attachment" "chatbot-notification-only-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "chatbot-notification-only"
    }

  # module.custom_iam_role_for_github.aws_iam_openid_connect_provider.github_actions will be created
  + resource "aws_iam_openid_connect_provider" "github_actions" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "1b511abead59c6ce207077c0bf0e0043b1382612",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.custom_iam_role_for_github.aws_iam_policy.github_actions will be created
  + resource "aws_iam_policy" "github_actions" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "minecraft-test-github-actions"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.custom_iam_role_for_github.aws_iam_role.github_actions will be created
  + resource "aws_iam_role" "github_actions" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:ShotaroMatsuya/minecraft-server-automation:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::528163014577:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "minecraft-test-github-actions"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.custom_iam_role_for_github.aws_iam_role_policy_attachment.github_actions will be created
  + resource "aws_iam_role_policy_attachment" "github_actions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "minecraft-test-github-actions"
    }

  # module.custom_sns.aws_kms_alias.for_encrypt_sns_topic_alias will be created
  + resource "aws_kms_alias" "for_encrypt_sns_topic_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/cwa/for_encrypt_sns_topic"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.custom_sns.aws_kms_key.for_encrypt_sns_topic will be created
  + resource "aws_kms_key" "for_encrypt_sns_topic" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "sns topic暗号化用"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::528163014577:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable Root User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow_CloudWatch_for_CMK"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                           = (known after apply)
    }

  # module.custom_sns.aws_sns_topic.main will be created
  + resource "aws_sns_topic" "main" {
      + application_success_feedback_sample_rate = 0
      + arn                                      = (known after apply)
      + content_based_deduplication              = false
      + display_name                             = "Reserved for notifications from AWS Chatbot to Slack"
      + fifo_topic                               = false
      + firehose_success_feedback_sample_rate    = 0
      + http_success_feedback_sample_rate        = 0
      + id                                       = (known after apply)
      + kms_master_key_id                        = (known after apply)
      + lambda_success_feedback_sample_rate      = 0
      + name                                     = "minecraft-test-sns-topic"
      + name_prefix                              = (known after apply)
      + owner                                    = (known after apply)
      + policy                                   = jsonencode(
            {
              + Id        = "__default_policy_ID"
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:GetTopicAttributes",
                          + "SNS:SetTopicAttributes",
                          + "SNS:AddPermission",
                          + "SNS:RemovePermission",
                          + "SNS:DeleteTopic",
                          + "SNS:Subscribe",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:Publish",
                          + "SNS:Receive",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "__default_statement_ID"
                    },
                  + {
                      + Action    = "sns:Publish"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "__default_statement_ID2"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + signature_version                        = (known after apply)
      + tags                                     = {
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + tags_all                                 = {
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + tracing_config                           = (known after apply)
    }

  # module.custom_sns.aws_sns_topic_subscription.main will be created
  + resource "aws_sns_topic_subscription" "main" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "https://global.sns-api.chatbot.amazonaws.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.custom_chatbot.module.chatbot_slack_configuration.aws_cloudformation_stack.chatbot_slack_configuration will be created
  + resource "aws_cloudformation_stack" "chatbot_slack_configuration" {
      + id            = (known after apply)
      + name          = "chatbot-slack-configuration-minecraft-test-chatbot"
      + outputs       = (known after apply)
      + parameters    = (known after apply)
      + policy_body   = (known after apply)
      + tags          = {
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + tags_all      = {
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + template_body = <<-EOT
            AWSTemplateFormatVersion: "2010-09-09"
            Description: AWS Chatbot Configuration
            Parameters:
              ConfigurationNameParameter:
                Type: String
                Description: The name of the configuration.
              GuardrailPoliciesParameter:
                Type: CommaDelimitedList
                Description: The list of IAM policy ARNs that are applied as channel guardrails. The AWS managed 'AdministratorAccess' policy is applied as a default if this is not set.
              IamRoleArnParameter:
                Type: String
                Description: The ARN of the IAM role that defines the permissions for AWS Chatbot. This is a user-defined role that AWS Chatbot will assume. This is not the service-linked role. For more information, see IAM Policies for AWS Chatbot.
              LoggingLevelParameter:
                Type: String
                Description: Specifies the logging level for this configuration. This property affects the log entries pushed to Amazon CloudWatch Logs. Logging levels include ERROR, INFO, or NONE.
                AllowedValues:
                  - ERROR
                  - INFO
                  - NONE
              SlackChannelIdParameter:
                Type: String
                Description: The ID of the Slack channel. To get the ID, open Slack, right click on the channel name in the left pane, then choose Copy Link. The channel ID is the 9-character string at the end of the URL. For example, ABCBBLZZZ.
              SlackWorkspaceIdParameter:
                Type: String
                Description: The ID of the Slack workspace authorized with AWS Chatbot. To get the workspace ID, you must perform the initial authorization flow with Slack in the AWS Chatbot console. Then you can copy and paste the workspace ID from the console. For more details, see steps 1-4 in Setting Up AWS Chatbot with Slack in the AWS Chatbot User Guide.
              SnsTopicArnsParameter:
                Type: CommaDelimitedList
                Description: The ARNs of the SNS topics that deliver notifications to AWS Chatbot.
              UserRoleRequiredParameter:
                Type: String
                Description: Enables use of a user role requirement in your chat configuration.
                AllowedValues:
                  - false
                  - true
            
            Resources:
              SlackChannelConfiguration:
                Type: AWS::Chatbot::SlackChannelConfiguration
                Properties:
                  ConfigurationName: !Ref ConfigurationNameParameter
                  GuardrailPolicies: !Ref GuardrailPoliciesParameter
                  IamRoleArn: !Ref IamRoleArnParameter
                  LoggingLevel: !Ref LoggingLevelParameter
                  SlackChannelId: !Ref SlackChannelIdParameter
                  SlackWorkspaceId: !Ref SlackWorkspaceIdParameter
                  SnsTopicArns: !Ref SnsTopicArnsParameter
                  UserRoleRequired: !Ref UserRoleRequiredParameter
            
            Outputs:
              ConfigurationArn:
                Description: The ARN of the Chatbot Slack configuration
                Value: !Ref SlackChannelConfiguration
        EOT
    }

  # module.custom_vpc.module.allow_nfs_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "EFS security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "minecraft-test-allow-nfs-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "minecraft-test-allow-nfs-sg"
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + tags_all               = {
          + "Name"        = "minecraft-test-allow-nfs-sg"
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.custom_vpc.module.allow_nfs_sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.custom_vpc.module.allow_nfs_sg.aws_security_group_rule.ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + description              = "Ingress Rule"
      + from_port                = 2049
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2049
      + type                     = "ingress"
    }

  # module.custom_vpc.module.fargate_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group with Ingress from other containers in the same security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "minecraft-test-fargate-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "minecraft-test-fargate-sg"
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + tags_all               = {
          + "Name"        = "minecraft-test-fargate-sg"
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.custom_vpc.module.fargate_sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.custom_vpc.module.fargate_sg.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Ingress from the public NLB"
      + from_port                = 25565
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 25565
      + type                     = "ingress"
    }

  # module.custom_vpc.module.fargate_sg.aws_security_group_rule.ingress_with_self[0] will be created
  + resource "aws_security_group_rule" "ingress_with_self" {
      + description              = "Ingress from other containers in the same security group"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.custom_vpc.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"        = "minecraft-test-myvpc"
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + tags_all = {
          + "Name"        = "minecraft-test-myvpc"
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + vpc_id   = (known after apply)
    }

  # module.custom_vpc.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.custom_vpc.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "minecraft-test-myvpc-public"
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + tags_all         = {
          + "Name"        = "minecraft-test-myvpc-public"
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + vpc_id           = (known after apply)
    }

  # module.custom_vpc.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.custom_vpc.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.custom_vpc.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "minecraft-test-myvpc-public-ap-northeast-1a"
          + "Type"        = "Public Subnets"
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + tags_all                                       = {
          + "Name"        = "minecraft-test-myvpc-public-ap-northeast-1a"
          + "Type"        = "Public Subnets"
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.custom_vpc.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "minecraft-test-myvpc-public-ap-northeast-1c"
          + "Type"        = "Public Subnets"
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + tags_all                                       = {
          + "Name"        = "minecraft-test-myvpc-public-ap-northeast-1c"
          + "Type"        = "Public Subnets"
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.custom_vpc.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"        = "minecraft-test-myvpc"
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + tags_all                             = {
          + "Name"        = "minecraft-test-myvpc"
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
    }

Plan: 33 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecs_task_execution_role = "minecraft-test-ecs_tasks_execution-role"
  + ecs_task_role           = "ecs_tasks-minecraft-test-role"
  + fargate_sg_group_id     = (known after apply)
  + vpc_id                  = (known after apply)

Warning: Deprecated attribute

  on ../modules/github/openid_connect_provider.tf line 6, in data "tls_certificate" "github_actions":
   6:   url = jsondecode(data.http.github_actions_openid_configuration.body).jwks_uri

The attribute "body" is deprecated. Refer to the provider documentation for
details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>